## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_linux_function_app.fcnapp will be updated in-place
  ~ resource "azurerm_linux_function_app" "fcnapp" {
        id                                = "/subscriptions/e2a2fd82-e1ce-49df-9bce-a5191e48e87d/resourceGroups/rg-terraformproject-staging/providers/Microsoft.Web/sites/fcnapp586d334c3618237a"
        name                              = "fcnapp586d334c3618237a"
      ~ service_plan_id                   = "/subscriptions/e2a2fd82-e1ce-49df-9bce-a5191e48e87d/resourceGroups/rg-terraformproject-staging/providers/Microsoft.Web/serverfarms/appservice-plan" -> (known after apply)
        tags                              = {}
        # (23 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_service_plan.app_plan must be replaced
-/+ resource "azurerm_service_plan" "app_plan" {
      ~ id                           = "/subscriptions/e2a2fd82-e1ce-49df-9bce-a5191e48e87d/resourceGroups/rg-terraformproject-staging/providers/Microsoft.Web/serverfarms/appservice-plan" -> (known after apply)
      ~ kind                         = "functionapp" -> (known after apply)
      ~ maximum_elastic_worker_count = 1 -> (known after apply)
      ~ name                         = "appservice-plan" -> "app-service-plan" # forces replacement
      ~ reserved                     = true -> (known after apply)
      - tags                         = {} -> null
      ~ worker_count                 = 0 -> (known after apply)
      - zone_balancing_enabled       = false -> null
        # (5 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```
</details>